[errorMsg]

PCT_ERR_FAIL="Неизвестная ошибка"

PCT_ERR_INVALUD_PARS="Неверный параметр"

PCT_ERR_NOT_SURPPORT="Не поддерживается"

PCT_ERR_OPEN_FILE_FAIL="Не удалось открыть файл"

PCT_ERR_NO_MEMORY="Недостаточно памяти"

PCT_ERR_READ_FILE="Не удалось прочитать файл."

PCT_ERR_FILE_FORMAT="Ошибка формата файла"

PCT_ERR_NOMORE_ITEM="Больше нет файлов"

PCT_ERR_FILE_PROCESS="Не удалось обработать файл"

PCT_ERR_MEMORY_FAIL="Ошибка памяти"

PCT_ERR_WRITE_FILE="Не удалось записать файл"

PCT_ERR_USER_CANCEL="Пользователь отменен"

PCT_ERR_NOT_INIT_FUN="Uninitialized"

PCT_ERR_CREATE_THREAD="Не удалось создать тему"

PCT_ERR_DEVICE_NO_MORE_SPACE="Недостаточно места на диске"

PCT_ERR_DEVICE_FAIL="Ошибка устройства"

PCT_ERR_PATH_INVALID="Неверный путь"

PCT_ERR_CALL_API="Не удалось позвонить"

PCT_ERR_FILE_NOT_EXIST="Файл не существует"

PCT_ERR_FILE_IN_USING="Файл используется другим процессом."

PCT_ERR_REG_FAIL="Ошибка реестра"

PCT_ERR_NET_CONN="Сеть не подключена или отключена"

PCT_ERR_LICENSE_OUTDATA="Срок действия лицензии истек"

PCT_ERR_NOT_SAME_VERSION="Версии несовместимы."

PCT_ERR_NO_DISKSPACE="Недостаточно места на диске."

PCT_ERR_NTFS_MUST="Не удалось перенести приложения, так как они не установлены в файловой системе NTFS."

PCT_ERR_INSTALL_APPX_FAILED="Эти приложения несовместимы с целевым ПК. Переустановка обязательна."

PCT_ERR_MOVE_APPX_FAILED="Приложение несовместимо с файловой системой целевого раздела."



